; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-4-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	)
(:init
	(at plane1 city4)
	(= (capacity plane1) 14382)
	(= (fuel plane1) 2639)
	(= (slow-burn plane1) 5)
	(= (fast-burn plane1) 16)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 2)
	(at plane2 city0)
	(= (capacity plane2) 4802)
	(= (fuel plane2) 1114)
	(= (slow-burn plane2) 2)
	(= (fast-burn plane2) 4)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 9)
	(at plane3 city2)
	(= (capacity plane3) 15311)
	(= (fuel plane3) 2352)
	(= (slow-burn plane3) 5)
	(= (fast-burn plane3) 11)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 9)
	(at plane4 city2)
	(= (capacity plane4) 10319)
	(= (fuel plane4) 2555)
	(= (slow-burn plane4) 4)
	(= (fast-burn plane4) 13)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 4)
	(at person1 city0)
	(at person2 city2)
	(at person3 city1)
	(at person4 city3)
	(at person5 city5)
	(at person6 city5)
	(at person7 city4)
	(at person8 city5)
	(at person9 city2)
	(at person10 city1)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 988)
	(= (distance city0 city2) 937)
	(= (distance city0 city3) 759)
	(= (distance city0 city4) 723)
	(= (distance city0 city5) 990)
	(= (distance city1 city0) 988)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 589)
	(= (distance city1 city3) 805)
	(= (distance city1 city4) 804)
	(= (distance city1 city5) 830)
	(= (distance city2 city0) 937)
	(= (distance city2 city1) 589)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 979)
	(= (distance city2 city4) 985)
	(= (distance city2 city5) 522)
	(= (distance city3 city0) 759)
	(= (distance city3 city1) 805)
	(= (distance city3 city2) 979)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 867)
	(= (distance city3 city5) 853)
	(= (distance city4 city0) 723)
	(= (distance city4 city1) 804)
	(= (distance city4 city2) 985)
	(= (distance city4 city3) 867)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 756)
	(= (distance city5 city0) 990)
	(= (distance city5 city1) 830)
	(= (distance city5 city2) 522)
	(= (distance city5 city3) 853)
	(= (distance city5 city4) 756)
	(= (distance city5 city5) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city2)
	(at person2 city1)
	(at person3 city1)
	(at person4 city4)
	(at person5 city0)
	(at person6 city1)
	(at person7 city3)
	(at person8 city2)
	(at person9 city5)
	(at person10 city4)
	))

(:metric minimize (+ (* 5 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (board person7 plane1 city4)
   deleted: (at person7 city4)
   added: (in person7 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 10
2. (refuel plane4 city2)
   changed: (fuel plane4) from 2555 to 10319
   goals met: 1 of 10
3. (refuel plane1 city4)
   changed: (fuel plane1) from 2639 to 14382
   goals met: 1 of 10
4. (zoom plane1 city4 city3)
   deleted: (at plane1 city4)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 0 to 13872, (fuel plane1) from 14382 to 510
   goals met: 1 of 10
5. (debark person7 plane1 city3)
   deleted: (in person7 plane1)
   added: (at person7 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 2 of 10
6. (fly plane4 city2 city5)
   deleted: (at plane4 city2)
   added: (at plane4 city5)
   changed: (total-fuel-used) from 13872 to 15960, (fuel plane4) from 10319 to 8231
   goals met: 2 of 10
7. (board person5 plane4 city5)
   deleted: (at person5 city5)
   added: (in person5 plane4)
   changed: (onboard plane4) from 0 to 1
   goals met: 2 of 10
8. (board person6 plane4 city5)
   deleted: (at person6 city5)
   added: (in person6 plane4)
   changed: (onboard plane4) from 1 to 2
   goals met: 2 of 10
9. (board person8 plane4 city5)
   deleted: (at person8 city5)
   added: (in person8 plane4)
   changed: (onboard plane4) from 2 to 3
   goals met: 2 of 10
10. (fly plane4 city5 city2)
   deleted: (at plane4 city5)
   added: (at plane4 city2)
   changed: (total-fuel-used) from 15960 to 18048, (fuel plane4) from 8231 to 6143
   goals met: 2 of 10
11. (board person2 plane4 city2)
   deleted: (at person2 city2)
   added: (in person2 plane4)
   changed: (onboard plane4) from 3 to 4
   goals met: 2 of 10
12. (debark person8 plane4 city2)
   deleted: (in person8 plane4)
   added: (at person8 city2)
   changed: (onboard plane4) from 4 to 3
   goals met: 3 of 10
13. (board person4 plane1 city3)
   deleted: (at person4 city3)
   added: (in person4 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 10
14. (refuel plane1 city3)
   changed: (fuel plane1) from 510 to 14382
   goals met: 3 of 10
15. (fly plane1 city3 city4)
   deleted: (at plane1 city3)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 18048 to 22383, (fuel plane1) from 14382 to 10047
   goals met: 3 of 10
16. (debark person4 plane1 city4)
   deleted: (in person4 plane1)
   added: (at person4 city4)
   changed: (onboard plane1) from 1 to 0
   goals met: 4 of 10
17. (board person9 plane4 city2)
   deleted: (at person9 city2)
   added: (in person9 plane4)
   changed: (onboard plane4) from 3 to 4
   goals met: 4 of 10
18. (fly plane4 city2 city5)
   deleted: (at plane4 city2)
   added: (at plane4 city5)
   changed: (total-fuel-used) from 22383 to 24471, (fuel plane4) from 6143 to 4055
   goals met: 4 of 10
19. (debark person9 plane4 city5)
   deleted: (in person9 plane4)
   added: (at person9 city5)
   changed: (onboard plane4) from 4 to 3
   goals met: 5 of 10
20. (fly plane1 city4 city0)
   deleted: (at plane1 city4)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 24471 to 28086, (fuel plane1) from 10047 to 6432
   goals met: 5 of 10
21. (board person1 plane1 city0)
   deleted: (at person1 city0)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 5 of 10
22. (fly plane1 city0 city2)
   deleted: (at plane1 city0)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 28086 to 32771, (fuel plane1) from 6432 to 1747
   goals met: 5 of 10
23. (debark person1 plane1 city2)
   deleted: (in person1 plane1)
   added: (at person1 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 6 of 10
24. (fly plane4 city5 city1)
   deleted: (at plane4 city5)
   added: (at plane4 city1)
   changed: (total-fuel-used) from 32771 to 36091, (fuel plane4) from 4055 to 735
   goals met: 6 of 10
25. (debark person2 plane4 city1)
   deleted: (in person2 plane4)
   added: (at person2 city1)
   changed: (onboard plane4) from 3 to 2
   goals met: 7 of 10
26. (debark person6 plane4 city1)
   deleted: (in person6 plane4)
   added: (at person6 city1)
   changed: (onboard plane4) from 2 to 1
   goals met: 8 of 10
27. (board person10 plane4 city1)
   deleted: (at person10 city1)
   added: (in person10 plane4)
   changed: (onboard plane4) from 1 to 2
   goals met: 8 of 10
28. (refuel plane4 city1)
   changed: (fuel plane4) from 735 to 10319
   goals met: 8 of 10
29. (fly plane4 city1 city0)
   deleted: (at plane4 city1)
   added: (at plane4 city0)
   changed: (total-fuel-used) from 36091 to 40043, (fuel plane4) from 10319 to 6367
   goals met: 8 of 10
30. (debark person5 plane4 city0)
   deleted: (in person5 plane4)
   added: (at person5 city0)
   changed: (onboard plane4) from 2 to 1
   goals met: 9 of 10
31. (fly plane4 city0 city4)
   deleted: (at plane4 city0)
   added: (at plane4 city4)
   changed: (total-fuel-used) from 40043 to 42935, (fuel plane4) from 6367 to 3475
   goals met: 9 of 10
32. (debark person10 plane4 city4)
   deleted: (in person10 plane4)
   added: (at person10 city4)
   changed: (onboard plane4) from 1 to 0
   goals met: 10 of 10
